Reports/20190814_144321/TS_GetCountryDetails/20190814_144321/requests/main/9.har

{
  "log" : {
    "version" : "1.2",
    "pages" : [ ],
    "entries" : [ {
      "startedDateTime" : "2019-08-14T04:43:44.192Z",
      "request" : {
        "method" : "SOAP",
        "url" : "http://webservices.oorsprong.org/websamples.countryinfo/CountryInfoService.wso?WSDL",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "queryString" : [ {
          "name" : "WSDL",
          "value" : ""
        } ],
        "postData" : {
          "mimeType" : "application/octet-stream",
          "text" : "<Envelope xmlns=\"http://schemas.xmlsoap.org/soap/envelope/\">\n    <Body>\n        <CountryCurrency xmlns=\"http://www.oorsprong.org/websamples.countryinfo\">\n            <sCountryISOCode>VN</sCountryISOCode>\n        </CountryCurrency>\n    </Body>\n</Envelope>",
          "comment" : ""
        },
        "headersSize" : 0,
        "bodySize" : 0,
        "comment" : ""
      },
      "response" : {
        "status" : 200,
        "statusText" : "",
        "httpVersion" : "",
        "cookies" : [ ],
        "headers" : [ ],
        "content" : {
          "size" : 422,
          "mimeType" : "application/xml",
          "text" : "<?xml version=\"1.0\" encoding=\"utf-8\"?>\r\n<soap:Envelope xmlns:soap=\"http://schemas.xmlsoap.org/soap/envelope/\">\r\n  <soap:Body>\r\n    <m:CountryCurrencyResponse xmlns:m=\"http://www.oorsprong.org/websamples.countryinfo\">\r\n      <m:CountryCurrencyResult>\r\n        <m:sISOCode>VND</m:sISOCode>\r\n        <m:sName>Dong</m:sName>\r\n      </m:CountryCurrencyResult>\r\n    </m:CountryCurrencyResponse>\r\n  </soap:Body>\r\n</soap:Envelope>",
          "comment" : ""
        },
        "redirectURL" : "",
        "headersSize" : 163,
        "bodySize" : 422,
        "comment" : ""
      },
      "cache" : { },
      "timings" : {
        "comment" : "",
        "send" : 0,
        "wait" : 0,
        "connect" : 1108,
        "dns" : -1,
        "receive" : 0,
        "blocked" : -1,
        "ssl" : -1
      },
      "comment" : "",
      "_katalonRequestInformation" : {
        "name" : "9",
        "testObjectId" : "Object Repository/CountryInfoSoapService/GetCurrency",
        "harId" : "d3ba4be6-19d4-41e7-a230-cc4399378f20",
        "reportFolder" : null
      },
      "time" : 1108
    } ],
    "comment" : ""
  }
}